Revit 2027 API
ElementWorksetFilter(WorksetId) Constructor
 Constructs a new instance of a filter to match elements in a given workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementWorksetFilter(
	WorksetId worksetId
)
Public Sub New (
	worksetId As WorksetId
)
public:
ElementWorksetFilter(
	WorksetId^ worksetId
)
new :
        worksetId : WorksetId -> ElementWorksetFilter
Parameters
worksetId WorksetId
 The workset id to match.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementWorksetFilter Class
ElementWorksetFilter Overload
Autodesk.Revit.DB Namespace